soc/game/富甲天下3 sum.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>富甲天下3 sum</title>
<!-- 2017-06-28 Wed 22:45 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">富甲天下3 sum</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 序言</a></li>
<li><a href="#sec-2">2. 富甲3全国地图终极修改V5.0攻略</a>
<ul>
<li><a href="#sec-2-1">2.1. 前提</a></li>
<li><a href="#sec-2-2">2.2. 前期——招募将领</a></li>
<li><a href="#sec-2-3">2.3. 中期——贸易生财</a></li>
<li><a href="#sec-2-4">2.4. 后期——攻城拔寨</a></li>
<li><a href="#sec-2-5">2.5. 终期——统一全国</a></li>
<li><a href="#sec-2-6">2.6. 经验</a></li>
<li><a href="#sec-2-7">2.7. 攻略FAQ</a>
<ul>
<li><a href="#sec-2-7-1">2.7.1. 前期兵力不足如何防守攻城？</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. 将领</a></li>
<li><a href="#sec-4">4. 建筑</a>
<ul>
<li><a href="#sec-4-1">4.1. 城池</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1. 城池过路费</a></li>
<li><a href="#sec-4-1-2">4.1.2. 城池将领</a></li>
<li><a href="#sec-4-1-3">4.1.3. 城池征兵所</a></li>
<li><a href="#sec-4-1-4">4.1.4. 城池市集</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2. 募兵所</a></li>
<li><a href="#sec-4-3">4.3. 锦囊铺</a></li>
</ul>
</li>
<li><a href="#sec-5">5. 其他FAQ</a>
<ul>
<li><a href="#sec-5-1">5.1. 如何查看数据文件？</a></li>
</ul>
</li>
<li><a href="#sec-6">6. 参考</a></li>
<li><a href="#sec-7">7. 其他</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 序言</h2>
<div class="outline-text-2" id="text-1">
<p>
富甲天下3的终极修改版本很有意思，和暗黑破坏神2的刷符文一样充满刺激。避免玩家因为策略失误导致游戏性下降，故写此攻略。
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 富甲3全国地图终极修改V5.0攻略</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 前提</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>允许无限SL
</li>
<li>禁武器：金箍棒
</li>
<li>禁攻城器械：加农炮
</li>
</ul>
<p>
由于难度实在太大，第一次刘备通关用了24H，还是在无限SL情况，如果没有，实在是太难。
</p>

<p>
富甲天下，赚钱优先！
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 前期——招募将领</h3>
<div class="outline-text-3" id="text-2-2">
<p>
优先招募将领，且优先有运输的将领，因为运输可以提高贸易效率，有了钱还怕啥？
</p>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 中期——贸易生财</h3>
<div class="outline-text-3" id="text-2-3">
<p>
运输将领凑齐后，全国贸易生财。
</p>

<ul class="org-ul">
<li>如果遇到聚贤庄，优先怕死将领（例如姜维等高逃跑的将领），因为不怕死将领容易被打死，可以去医院复活（前期不用急着复活），怕死将领被电脑招募后，就永远招募不了了。（这条用于统招版）
</li>
<li>如果遇到锦囊铺，至少刷1个暗渡陈仓、以逸待劳、严阵以待（'、'表示或者，1个是因为避免SL无聊）。如果钱足，遇到过河拆迁或杀人放火，也买，用于破坏4大城洛阳、长安、成都、荆州。
</li>
<li>如果遇到医院，优先强身，不用优先复活。
</li>
<li>如果遇到武馆，优先武力，因为野战属性太多，分散了属性点。
</li>
<li>如果遇到书馆，优先智力，因为智力在单挑和野战都有用。
</li>
<li>如果遇到武器店，单挑将惯石枪或屠龙刀、野战将倚天剑、军师水镜扇。
</li>
<li>如果遇到机关店，优先杀伤，因为破坏城池意义不大。
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 后期——攻城拔寨</h3>
<div class="outline-text-3" id="text-2-4">
<p>
攻城策略：至少身上有锦囊三宝之一，暗渡陈仓、以逸待劳、严阵以待，用于攻城后建造特产坊（严阵以待可能会用不上）！优先有特产的，还是那句话，有了钱还怕啥？然后继续贸易生财。
</p>

<ul class="org-ul">
<li>如果遇到没有特产的城池，不攻，因为无法提高贸易效率，还要分配将领、士兵把守。
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 终期——统一全国</h3>
<div class="outline-text-3" id="text-2-5">
<p>
这个时候，基本占领了主要的城市（有特产的城池），就等着电脑主动来送，不可胜在己，可胜在敌。
</p>

<ul class="org-ul">
<li>如果遇到没有特产的城池，攻但是不占，削弱分散电脑资源。
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 经验</h3>
<div class="outline-text-3" id="text-2-6">
<p>
后期敌人曹操很顽强，因为统率高，可以野战，而且典韦血高攻高，可以单挑。
</p>

<p>
城池里不用留钱，钱用来投资比留在城池里好的多（除非钱很多），富甲天下。
</p>

<p>
尽量使用9格骰子，方便SL，12格需要SL更多次。
</p>

<p>
有暗渡陈仓就去成都区域刷数据，那里有3个锦囊铺和1个聚贤庄和1个募兵所和1个机关所。
</p>

<p>
智力底下的将领使用"以逸待劳"会失败。
</p>
</div>
</div>
<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> 攻略FAQ</h3>
<div class="outline-text-3" id="text-2-7">
</div><div id="outline-container-sec-2-7-1" class="outline-4">
<h4 id="sec-2-7-1"><span class="section-number-4">2.7.1</span> 前期兵力不足如何防守攻城？</h4>
<div class="outline-text-4" id="text-2-7-1">
<p>
SL，别无他法。
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 将领</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>体力：140 130
</li>
<li>武力：110 100
</li>
<li>军师智力：110 100
</li>
<li>将军智力：80 70
</li>
</ul>


<ul class="org-ul">
<li>高体高武低智：例如许褚、文丑。
</li>
<li>高体中武中智：例如夏侯渊、关兴、程普。
</li>
<li>高体中武低智：例如曹洪、沙摩柯
</li>
<li>中体高武高智：例如张辽、关羽。
</li>
<li>中体高武中智：例如庞德、黄忠、孙策。
</li>
<li>中体高武低智：例如夏侯惇、张飞。
</li>
<li>中体中武高智：例如张合、孙坚。 
</li>
<li>中体中武中智：例如徐晃。
</li>
<li>中体中武低智：例如曹仁、张苞、周泰。
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 建筑</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 城池</h3>
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> 城池过路费</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
主要和发展金有关。
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="right">规模</td>
<td class="left">过路费MAX</td>
</tr>

<tr>
<td class="right">6</td>
<td class="left">5w+</td>
</tr>

<tr>
<td class="right">5</td>
<td class="left">2w+</td>
</tr>

<tr>
<td class="right">4</td>
<td class="left">1w+</td>
</tr>

<tr>
<td class="right">3</td>
<td class="left">5k+</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> 城池将领</h4>
<div class="outline-text-4" id="text-4-1-2">
<ul class="org-ul">
<li>太守：智力将领上，用于提升发展金。
</li>
<li>校尉：统率将领上，用于野战和提升征兵的速度。
</li>
<li>守将：怕死将领上，用于单挑消耗恶心电脑。
</li>
<li>守将2：强力将领上（5-6规模城池用怕死的，4规模城池用不怕死的，3规模城池不用放），用于单挑击败电脑。
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4">4.1.3</span> 城池征兵所</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
5级征兵所（最高等级）一天增加200+士兵。
</p>
</div>
</div>
<div id="outline-container-sec-4-1-4" class="outline-4">
<h4 id="sec-4-1-4"><span class="section-number-4">4.1.4</span> 城池市集</h4>
<div class="outline-text-4" id="text-4-1-4">
<p>
200商业度一天增加300+金钱。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 募兵所</h3>
<div class="outline-text-3" id="text-4-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">士兵数</td>
<td class="left">金钱数</td>
</tr>

<tr>
<td class="left">1k</td>
<td class="left">1k</td>
</tr>

<tr>
<td class="left">5k</td>
<td class="left">1w</td>
</tr>

<tr>
<td class="left">1w</td>
<td class="left">5w</td>
</tr>

<tr>
<td class="left">2w</td>
<td class="left">15w</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 锦囊铺</h3>
<div class="outline-text-3" id="text-4-3">
<p>
介绍重要锦囊。
</p>

<ul class="org-ul">
<li>暗渡陈仓、以逸待劳、严阵以待：用于到达指定地点，效果依次递减。
</li>
<li>回光返照：用于培养单挑达人。
</li>
<li>临危不惧：用于避免敌人的打草惊蛇、釜底抽薪的锦囊损失。
</li>
<li>无懈可击：避免敌人的借刀杀人。
</li>
<li>临阵磨枪：用于攻城，减少士兵损失。
</li>
<li>笑里藏刀、无所遁形：用于减少SL次数，意义不大。
</li>
<li>过河拆桥、放火杀人：用于减少5-6规模大城的征兵，避免攻城时城池兵力达到10w（一般不可能，中立城池只有一个征兵所，不用刻意刷）。
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 其他FAQ</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 如何查看数据文件？</h3>
<div class="outline-text-3" id="text-5-1">
<p>
emacs
mx hexl-mode
google emacs 16进制
</p>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 参考</h2>
<div class="outline-text-2" id="text-6">
<p>
<a href="http://blog.sina.com.cn/s/blog_50c49cb50100rojr.html">http://blog.sina.com.cn/s/blog_50c49cb50100rojr.html</a>
</p>

<p>
<a href="https://tieba.baidu.com/p/2750886182">https://tieba.baidu.com/p/2750886182</a>
</p>

<p>
刘备6格，曹操7格，孙权8格，袁绍10格。 <a href="https://tieba.baidu.com/p/2750886182?pn=1">https://tieba.baidu.com/p/2750886182?pn=1</a>
</p>

<p>
电脑五倍兵攻城 <a href="https://tieba.baidu.com/p/2750886182?pn=2">https://tieba.baidu.com/p/2750886182?pn=2</a>
</p>

<p>
骰子赌场出错，Tab+f1+Backspace，输入ru4a.62 <a href="https://tieba.baidu.com/p/2750886182?pn=4">https://tieba.baidu.com/p/2750886182?pn=4</a>
</p>

<p>
<a href="https://www.ptt.cc/bbs/Old-Games/M.1325651773.A.C90.html">https://www.ptt.cc/bbs/Old-Games/M.1325651773.A.C90.html</a>
</p>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 其他</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-06-28 Wed 22:45</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
